const _ = require('lodash')
const fs = require('fs')
const path = require('path')

// Language: JavaScript

const data = [['北京市', [['北京市', [['东城区', [['东华门街道'], ['景山街道'], ['交道口街道'], ['安定门街道']]]]]]], ['广东省', [['深圳市', [['罗湖区', [['桂园街道'], ['黄贝街道'], ['东门街道'], ['翠竹街道'], ['南湖街道'], ['笋岗街道'], ['东湖街道'], ['莲塘街道'], ['东晓街道'], ['清水河街道']]], ['福田区', [['南园街道'], ['园岭街道'], ['福田街道'], ['沙头街道'], ['香蜜湖街道'], ['梅林街道'], ['莲花街道'], ['华富街道'], ['福保街道'], ['华强北街道'], ['福田保税区']]], ['南山区', [['南头街道'], ['南山街道'], ['沙河街道'], ['蛇口街道'], ['招商街道'], ['粤海街道'], ['桃源街道'], ['西丽街道'], ['前海合作区']]], ['宝安区', [['新安街道'], ['西乡街道'], ['航城街道'], ['福永街道'], ['福海街道'], ['沙井街道'], ['新桥街道'], ['松岗街道'], ['燕罗街道'], ['石岩街道'], ['深圳市宝安国际机场']]], ['龙岗区', [['平湖街道'], ['坪地街道'], ['葵涌街道'], ['大鹏街道'], ['南澳街道'], ['南湾街道'], ['坂田街道'], ['布吉街道'], ['龙城街道'], ['龙岗街道'], ['横岗街道'], ['吉华街道'], ['宝龙街道'], ['园山街道']]], ['盐田区', [['梅沙街道'], ['盐田街道'], ['沙头角街道'], ['海山街道'], ['市保税区（沙头角）'], ['市保税区（盐田港）']]], ['龙华区', [['观湖街道'], ['民治街道'], ['龙华街道'], ['大浪街道'], ['福城街道'], ['观澜街道']]], ['坪山区', [['坪山街道'], ['马峦街道'], ['碧岭街道'], ['石井街道'], ['坑梓街道'], ['龙田街道'], ['深圳市大工业区']]], ['光明区', [['光明街道'], ['公明街道'], ['新湖街道'], ['凤凰街道'], ['玉塘街道'], ['马田街道']]]]]]]]

const transform = row => {
  const [value, children] = row
  const rs = {
    label: value,
    value
  }
  if (children) {
    rs.children = _.map(children, item => transform(item))
  }
  return rs
}

const res = _.map(data, item => transform(item))

jsonOut('testData', res)
function jsonOut (name, data) {
  fs.writeFileSync(
    path.resolve(__dirname, `../dist/${name}.json`),
    JSON.stringify(data))
}
